class AppConstant {
  static String saveUserToken = "userToken";
  static String getUserToken = "";
  static String userName = "";
  static String userEmail = "";
  static String courseID = '';
  static String videoUrl = '';

  static String privacypolicy = '''
            رجمة وصف التطبيق من الإنجليزية إلى العربية

            تطبيقنا مصمم لتوفير تجربة سلسة ومريحة لحفظ وإدارة مقاطع الفيديو والكتب على جهازك المحمول. لتحقيق ذلك، نطلب الوصول إلى إذن "الوصول إلى جميع الملفات".

            لماذا نحتاج إلى "الوصول إلى جميع الملفات"

            حفظ وتنظيم المحتوى الخاص بك: باستخدام "الوصول إلى جميع الملفات"، يمكننا تخزين مقاطع الفيديو والكتب الخاصة بك بأمان في موقع من اختيارك على جهازك. يتيح لك هذا إبقاء المحتوى الخاص بك منظمًا ويمكن الوصول إليه وقتما تحتاج إليه.
            التحكم الموجه نحو المستخدم: نؤمن بمنحك التحكم الكامل في مكان تخزين المحتوى الخاص بك. يتيح لك "الوصول إلى جميع الملفات" اختيار الدليل أو المجلد الذي تريد حفظ مقاطع الفيديو والكتب فيه، مما يضمن تجربة شخصية وموجهة نحو المستخدم.
            الوصول في وضع عدم الاتصال: من خلال الاستفادة من هذا الإذن، فإننا نتيح لك الاستمتاع بمقاطع الفيديو والكتب الخاصة بك حتى عندما تكون في وضع عدم الاتصال. سواء كنت على متن طائرة، أو في موقع ناءٍ، أو ببساطة تفضل عدم الاعتماد على اتصال بالإنترنت، فإن تطبيقنا يضمن أن يكون المحتوى الخاص بك متاحًا بسهولة.
            النسخ الاحتياطي والاستعادة: يتيح لنا "الوصول إلى جميع الملفات" أيضًا توفير ميزات نسخ احتياطي واستعادة قوية. يمكن نسخ مقاطع الفيديو والكتب الخاصة بك احتياطيًا بأمان إلى الموقع الذي تفضله، مما يسمح لك باستعادة المحتوى الخاص بك في حالة فقد الجهاز أو حذف البيانات.
            خصوصيتك مهمة

            نحن نأخذ خصوصيتك على محمل الجد. كن مطمئنًا إلى أننا نصل إلى ملفاتك ونعالجها بأقصى قدر من العناية والأمان. نحن لا نجمع أو نشارك أو نسيء استخدام بياناتك الشخصية أو محتواك بأي شكل من الأشكال. ثقتك في تطبيقنا ذات أهمية قصوى بالنسبة لنا
            ''';
}
